{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_4", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_43", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_43", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_80", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_80", "inbound_nodes": [[["batch_normalization_43", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["activation_80", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_44", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_44", "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_81", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_81", "inbound_nodes": [[["batch_normalization_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 896, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["activation_81", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_45", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_45", "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_82", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_82", "inbound_nodes": [[["batch_normalization_45", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "dtype": "float32", "target_shape": [32, 2, 14]}, "name": "reshape_7", "inbound_nodes": [[["activation_82", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_32", "inbound_nodes": [[["reshape_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_46", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_46", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_83", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_83", "inbound_nodes": [[["batch_normalization_46", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_33", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_33", "inbound_nodes": [[["activation_83", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_47", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_47", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_84", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_84", "inbound_nodes": [[["batch_normalization_47", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_4", "inbound_nodes": [[["activation_84", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_48", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_48", "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_85", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_85", "inbound_nodes": [[["batch_normalization_48", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_34", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_34", "inbound_nodes": [[["activation_85", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_49", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_49", "inbound_nodes": [[["conv2d_34", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_86", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_86", "inbound_nodes": [[["batch_normalization_49", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_35", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_35", "inbound_nodes": [[["activation_86", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_50", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_50", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_87", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_87", "inbound_nodes": [[["batch_normalization_50", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_5", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_5", "inbound_nodes": [[["activation_87", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_51", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_51", "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_88", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_88", "inbound_nodes": [[["batch_normalization_51", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_36", "inbound_nodes": [[["activation_88", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_52", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_52", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_89", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_89", "inbound_nodes": [[["batch_normalization_52", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_37", "inbound_nodes": [[["activation_89", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_53", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_53", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_90", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_90", "inbound_nodes": [[["batch_normalization_53", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_6", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_6", "inbound_nodes": [[["activation_90", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_54", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_54", "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_91", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_91", "inbound_nodes": [[["batch_normalization_54", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_38", "inbound_nodes": [[["activation_91", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_55", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_55", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_92", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_92", "inbound_nodes": [[["batch_normalization_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_39", "inbound_nodes": [[["activation_92", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_56", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_56", "inbound_nodes": [[["conv2d_39", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_93", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_93", "inbound_nodes": [[["batch_normalization_56", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_7", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_7", "inbound_nodes": [[["activation_93", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_57", "inbound_nodes": [[["conv2d_transpose_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_94", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_94", "inbound_nodes": [[["batch_normalization_57", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "dtype": "float32", "target_shape": [32, 32, 2, 7]}, "name": "reshape_8", "inbound_nodes": [[["activation_94", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_33", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_33", "inbound_nodes": [[["reshape_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_95", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_95", "inbound_nodes": [[["conv3d_33", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_34", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_34", "inbound_nodes": [[["activation_95", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_96", "inbound_nodes": [[["conv3d_34", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_4", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_4", "inbound_nodes": [[["activation_96", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_97", "inbound_nodes": [[["conv3d_transpose_4", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_35", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_35", "inbound_nodes": [[["activation_97", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_98", "inbound_nodes": [[["conv3d_35", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_36", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_36", "inbound_nodes": [[["activation_98", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_99", "inbound_nodes": [[["conv3d_36", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_5", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_5", "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_100", "inbound_nodes": [[["conv3d_transpose_5", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_37", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_37", "inbound_nodes": [[["activation_100", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_101", "inbound_nodes": [[["conv3d_37", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_38", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_38", "inbound_nodes": [[["activation_101", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_102", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_102", "inbound_nodes": [[["conv3d_38", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_6", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_6", "inbound_nodes": [[["activation_102", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_103", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_103", "inbound_nodes": [[["conv3d_transpose_6", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_39", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_39", "inbound_nodes": [[["activation_103", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_104", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_104", "inbound_nodes": [[["conv3d_39", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_40", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_40", "inbound_nodes": [[["activation_104", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_105", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_105", "inbound_nodes": [[["conv3d_40", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_7", "trainable": true, "dtype": "float32", "filters": 14, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_7", "inbound_nodes": [[["activation_105", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_106", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_106", "inbound_nodes": [[["conv3d_transpose_7", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_41", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_41", "inbound_nodes": [[["activation_106", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_107", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_107", "inbound_nodes": [[["conv3d_41", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "dtype": "float32", "target_shape": [32768, 5]}, "name": "reshape_9", "inbound_nodes": [[["activation_107", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["reshape_9", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_43/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_43/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_43/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_43/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_44/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_44/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_44/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_44/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_45/gamma", "shape": [896], "dtype": "float32"}, {"name": "batch_normalization_45/beta", "shape": [896], "dtype": "float32"}, {"name": "batch_normalization_45/moving_mean", "shape": [896], "dtype": "float32"}, {"name": "batch_normalization_45/moving_variance", "shape": [896], "dtype": "float32"}, {"name": "batch_normalization_46/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_46/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_46/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_46/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_47/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_47/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_47/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_47/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_48/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_48/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_48/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_48/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_49/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_49/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_49/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_49/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_50/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_50/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_50/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_50/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_51/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_51/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_51/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_51/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_52/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_52/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_52/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_52/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_53/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_53/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_53/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_53/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_54/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_54/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_54/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_54/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_55/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_55/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_55/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_55/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_56/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_56/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_56/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_56/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_57/gamma", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_57/beta", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_57/moving_mean", "shape": [14], "dtype": "float32"}, {"name": "batch_normalization_57/moving_variance", "shape": [14], "dtype": "float32"}, {"name": "conv2d_32/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_33/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_34/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_35/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_36/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_37/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_38/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_39/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_transpose_4/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_transpose_5/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_transpose_6/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv2d_transpose_7/kernel", "shape": [3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_33/kernel", "shape": [3, 3, 3, 7, 14], "dtype": "float32"}, {"name": "conv3d_33/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_34/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_34/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_35/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_35/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_36/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_36/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_37/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_37/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_38/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_38/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_39/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_39/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_40/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_40/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_41/kernel", "shape": [3, 3, 3, 14, 5], "dtype": "float32"}, {"name": "conv3d_41/bias", "shape": [5], "dtype": "float32"}, {"name": "conv3d_transpose_4/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_transpose_4/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_transpose_5/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_transpose_5/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_transpose_6/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_transpose_6/bias", "shape": [14], "dtype": "float32"}, {"name": "conv3d_transpose_7/kernel", "shape": [3, 3, 3, 14, 14], "dtype": "float32"}, {"name": "conv3d_transpose_7/bias", "shape": [14], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [2, 16], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [16, 64], "dtype": "float32"}, {"name": "dense_13/kernel", "shape": [64, 896], "dtype": "float32"}]}]}