{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_34", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_27"}, "name": "input_27", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_89", "inbound_nodes": [[["input_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_289", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_289", "inbound_nodes": [[["dense_89", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_527", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_527", "inbound_nodes": [[["batch_normalization_289", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_90", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_90", "inbound_nodes": [[["activation_527", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_290", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_290", "inbound_nodes": [[["dense_90", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_528", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_528", "inbound_nodes": [[["batch_normalization_290", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_91", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_91", "inbound_nodes": [[["activation_528", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_291", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_291", "inbound_nodes": [[["dense_91", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_529", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_529", "inbound_nodes": [[["batch_normalization_291", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_62", "trainable": true, "dtype": "float32", "target_shape": [16, 2, 6]}, "name": "reshape_62", "inbound_nodes": [[["activation_529", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_195", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_195", "inbound_nodes": [[["reshape_62", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_292", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_292", "inbound_nodes": [[["conv2d_195", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_530", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_530", "inbound_nodes": [[["batch_normalization_292", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_196", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_196", "inbound_nodes": [[["activation_530", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_293", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_293", "inbound_nodes": [[["conv2d_196", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_531", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_531", "inbound_nodes": [[["batch_normalization_293", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_33", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_33", "inbound_nodes": [[["activation_531", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_294", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_294", "inbound_nodes": [[["conv2d_transpose_33", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_532", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_532", "inbound_nodes": [[["batch_normalization_294", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_197", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_197", "inbound_nodes": [[["activation_532", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_295", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_295", "inbound_nodes": [[["conv2d_197", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_533", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_533", "inbound_nodes": [[["batch_normalization_295", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_198", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_198", "inbound_nodes": [[["activation_533", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_296", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_296", "inbound_nodes": [[["conv2d_198", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_534", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_534", "inbound_nodes": [[["batch_normalization_296", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_34", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_34", "inbound_nodes": [[["activation_534", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_297", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_297", "inbound_nodes": [[["conv2d_transpose_34", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_535", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_535", "inbound_nodes": [[["batch_normalization_297", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_199", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_199", "inbound_nodes": [[["activation_535", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_298", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_298", "inbound_nodes": [[["conv2d_199", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_536", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_536", "inbound_nodes": [[["batch_normalization_298", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_200", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_200", "inbound_nodes": [[["activation_536", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_299", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_299", "inbound_nodes": [[["conv2d_200", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_537", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_537", "inbound_nodes": [[["batch_normalization_299", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_35", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_35", "inbound_nodes": [[["activation_537", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_300", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_300", "inbound_nodes": [[["conv2d_transpose_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_538", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_538", "inbound_nodes": [[["batch_normalization_300", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_63", "trainable": true, "dtype": "float32", "target_shape": [16, 16, 2, 3]}, "name": "reshape_63", "inbound_nodes": [[["activation_538", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_208", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_208", "inbound_nodes": [[["reshape_63", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_539", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_539", "inbound_nodes": [[["conv3d_208", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_209", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_209", "inbound_nodes": [[["activation_539", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_540", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_540", "inbound_nodes": [[["conv3d_209", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_30", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_30", "inbound_nodes": [[["activation_540", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_541", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_541", "inbound_nodes": [[["conv3d_transpose_30", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_210", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_210", "inbound_nodes": [[["activation_541", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_542", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_542", "inbound_nodes": [[["conv3d_210", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_211", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_211", "inbound_nodes": [[["activation_542", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_543", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_543", "inbound_nodes": [[["conv3d_211", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_31", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_31", "inbound_nodes": [[["activation_543", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_544", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_544", "inbound_nodes": [[["conv3d_transpose_31", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_212", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_212", "inbound_nodes": [[["activation_544", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_545", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_545", "inbound_nodes": [[["conv3d_212", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_213", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_213", "inbound_nodes": [[["activation_545", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_546", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_546", "inbound_nodes": [[["conv3d_213", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_32", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_32", "inbound_nodes": [[["activation_546", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_547", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_547", "inbound_nodes": [[["conv3d_transpose_32", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_214", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_214", "inbound_nodes": [[["activation_547", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_548", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_548", "inbound_nodes": [[["conv3d_214", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_64", "trainable": true, "dtype": "float32", "target_shape": [4096, 5]}, "name": "reshape_64", "inbound_nodes": [[["activation_548", 0, 0, {}]]]}], "input_layers": [["input_27", 0, 0]], "output_layers": [["reshape_64", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_289/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_289/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_289/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_289/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_290/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_290/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_290/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_290/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_291/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_291/beta", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_291/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_291/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_292/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_292/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_292/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_292/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_293/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_293/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_293/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_293/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_294/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_294/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_294/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_294/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_295/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_295/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_295/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_295/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_296/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_296/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_296/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_296/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_297/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_297/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_297/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_297/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_298/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_298/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_298/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_298/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_299/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_299/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_299/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_299/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_300/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_300/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_300/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_300/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "conv2d_195/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_196/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_197/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_198/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_199/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_200/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_transpose_33/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_transpose_34/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv2d_transpose_35/kernel", "shape": [3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_208/kernel", "shape": [3, 3, 3, 3, 6], "dtype": "float32"}, {"name": "conv3d_208/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_209/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_209/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_210/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_210/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_211/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_211/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_212/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_212/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_213/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_213/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_214/kernel", "shape": [3, 3, 3, 6, 5], "dtype": "float32"}, {"name": "conv3d_214/bias", "shape": [5], "dtype": "float32"}, {"name": "conv3d_transpose_30/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_transpose_30/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_transpose_31/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_transpose_31/bias", "shape": [6], "dtype": "float32"}, {"name": "conv3d_transpose_32/kernel", "shape": [3, 3, 3, 6, 6], "dtype": "float32"}, {"name": "conv3d_transpose_32/bias", "shape": [6], "dtype": "float32"}, {"name": "dense_89/kernel", "shape": [2, 16], "dtype": "float32"}, {"name": "dense_90/kernel", "shape": [16, 64], "dtype": "float32"}, {"name": "dense_91/kernel", "shape": [64, 192], "dtype": "float32"}]}]}